# ============================================
# ЗАДАНИЕ 1: Работа с типами данных
# ============================================
# Создайте переменные разных типов и выведите их типы:
# - строку "Привет"
# - целое число 42
# - число с точкой 3.14
# - список [1, 2, 3]
a = "Привет"
b = 42
c = 3.14
d = [1, 2, 3]
print(type(a), type(b), type(c), type(d))
# ============================================
# ЗАДАНИЕ 2: Преобразование регистра строк
# ============================================
# Дана строка: "python PROGRAMMING"
# 1. Переведите всю строку в нижний регистр
# 2. Переведите всю строку в верхний регистр
# 3. Сделайте первую букву заглавной
# 4. Сделайте каждое слово с заглавной буквы
text = "python PROGRAMMING"
print(text.lower())
print(text.upper())
print(text.capitalize())
print(text.title())
# ============================================
# ЗАДАНИЕ 3: Удаление пробелов
# ============================================
# Дана строка с пробелами: "  Hello World  "
# 1. Удалите пробелы с обоих концов
# 2. Удалите пробелы только слева
# 3. Удалите пробелы только справа
text3 = "  Hello World  "
print(text3.strip())
print(text3.lstrip())
print(text3.rstrip())
# ============================================
# ЗАДАНИЕ 4: Разделение и объединение строк
# ============================================
# Дана строка: "яблоко,банан,апельсин,груша"
# 1. Разделите строку по запятой и сохраните в список
# 2. Объедините элементы списка обратно в строку, но используя разделитель " | "
text4 = "apple,banana,orange,pear"
fruits = text4.split(",")
print(fruits)
text4 = "|".join(fruits)
print(text4)
# ============================================
# ЗАДАНИЕ 5: Замена подстрок
# ============================================
# Дана строка: "Я изучаю Python. Python - это круто!"
# Замените все вхождения "Python" на "Java"

text5 = "Я изучаю Python. Python - это круто!"
new_text4 = text5.replace("Python", "Java")
print(new_text4)

# ============================================
# ЗАДАНИЕ 6: Поиск и подсчет
# ============================================
# Дана строка: "Python программирование на Python"
# 1. Найдите индекс первого вхождения "Python"
# 2. Посчитайте, сколько раз встречается "Python"
# 3. Проверьте, есть ли в строке слово "Java" (используйте find)

text6 = "Python программирование на Python"
print(text6.find("Python"))
print(text6.count("Python"))
print(text6.find("Java"))

# ============================================
# ЗАДАНИЕ 7: Проверка типа символов
# ============================================
# Проверьте следующие строки:
# 1. "Hello123" - содержит только буквы и цифры?
# 2. "12345" - содержит только цифры?
# 3. "Hello" - содержит только буквы?
# 4. "   " - содержит только пробелы?

a = "Hello123"
b = "12345"
c = "Hello"
d = "   "
print(a.isalnum())
print(b.isdigit())
print(c.isalpha())
print(d.isspace())

# ============================================
# ЗАДАНИЕ 8: Срезы строк
# ============================================
# Дана строка: "Python very good"
# 1. Выведите первые 3 символа
# 2. Выведите последние 3 символа
# 3. Выведите строку с шагом 2 (каждый второй символ)
# 4. Переверните строку

text8 = "Python very good"
print(text8[:3])
print(text8[-3:])
print(text8[::2])
print(text8[::-1])

# ============================================
# ЗАДАНИЕ 9: Экранирование символов
# ============================================
# Выведите следующие строки:
# 1. "Он сказал: "Привет"" (с кавычками внутри)
# 2. Строку с переносом: "Первая строка Вторая строка"

a = 'Он сказал: "Привет"'
print(a)
b = "Первая строка \nВторая строка"
print(b)

# ============================================
# ЗАДАНИЕ 10: Добавление элементов в список
# ============================================
# Начните со списка: fruits = ["яблоко"]
# 1. Добавьте "банан" в конец списка
# 2. Добавьте элементы ["апельсин", "груша"]
# 3. Вставьте "виноград" на позицию с индексом 1

fruits = ["яблоко"]
fruits.append("банан")
fruits.extend(["апельсин", "груша"])
fruits.insert(1, "виноград")
print(fruits)

# ============================================
# ЗАДАНИЕ 11: Удаление элементов из списка
# ============================================
# Дана список: fruits = ["яблоко", "банан", "апельсин", "банан"]
# 1. Удалите первое вхождение "банан" (remove)
# 2. Удалите последний элемент и сохраните его в переменную

text11 = ["яблоко", "банан", "апельсин", "банан"]
text11.remove("банан")
print(text11)
text111 = text11.pop()
print(text111)

# ============================================
# ЗАДАНИЕ 12: Поиск элементов в списке
# ============================================
# Дана список: fruits = ["яблоко", "банан", "апельсин", "банан"]
# 1. Найдите индекс первого вхождения "банан"
# 2. Посчитайте, сколько раз встречается "банан"

fruits = ["яблоко", "банан", "апельсин", "банан"]
print(fruits.index("банан"))
print(fruits.count("банан"))

# ============================================
# ЗАДАНИЕ 13: Сортировка и реверс списка
# ============================================
# Дана список: numbers = [3, 1, 4, 1, 5, 9, 2]
# 1. Отсортируйте список по возрастанию (sort)
# 2. Переверните список (reverse)
# 3. Выведите результат

numbers = [3, 1, 4, 1, 5, 9, 2]
numbers.sort()
print(numbers)
numbers.reverse()
print(numbers)

# ============================================
# БОНУСНОЕ 14: Комбинированная задача
# ============================================
# Дана строка с именами: "Иван,Петр,Мария,Анна"
# 1. Разделите строку на список имен
# 2. Добавьте в список имя "Ольга"
# 3. Отсортируйте список по алфавиту
# 4. Объедините имена обратно в строку через запятую и пробел: "Анна, Иван, Мария, Ольга, Петр"
# 5. Выведите результат

name = "Иван,Петр,Мария,Анна"
name_list = name.split(",")
print(name_list)
name_list.append("Ольга")
print(name_list)
name_list.sort()
print(name_list)
text14 = ", ".join(name_list)
print(text14)
